Repository: MehulNJain/techathon
Catalog: lib/l10n/app_*.arb
Languages: hi

# app_title
source: Smart Civic Portal
hi: स्मार्ट नागरिक पोर्टल

# login_subtitle
source: Report civic issues and connect with your local government
hi: समस्याएँ बताइए और सरकार से जुड़ें

source: Phone Number
hi: फोन नंबर

# enter_phone_number
source: Enter your phone number
hi: फोन नंबर लिखें

source: Send OTP
hi: ओटीपी भेजें

source: Login as Worker
hi: कर्मचारी लॉगिन

# government_initiative
source: Government of Jharkhand Initiative
hi: सरकार की पहल

# secure_and_verified
source: Secure & Verified
hi: सुरक्षित और प्रमाणित

source: English
hi: अंग्रेज़ी

source: Hindi
hi: हिन्दी

# enter_valid_phone
source: Enter a valid 10-digit phone number
hi: सही 10 अंकों का फोन नंबर डालें

# enter_phone_number_message
source: Enter phone number
hi: फोन नंबर लिखें

source: Verification Failed
hi: जाँच असफल

# error_message
source: Error
hi: गलती

source: Verify OTP
hi: ओटीपी चेक करें

# enter_otp_code
source: Enter the 6-digit code sent
hi: भेजा गया 6 अंकों का कोड लिखें

# verify_and_login
source: Verify & Login
hi: चेक करें और लॉगिन करें

source: Didn't receive OTP?
hi: ओटीपी नहीं मिला?

source: Resend
hi: फिर से भेजें

# otp_resent_web
source: OTP resent successfully (Web)
hi: ओटीपी दोबारा भेजा गया (वेब)

# otp_resent_mobile
source: OTP resent successfully (Mobile)
hi: ओटीपी दोबारा भेजा गया (मोबाइल)

# complete_profile
source: Complete Your Profile
hi: प्रोफ़ाइल पूरी करें

# profile_subtitle
source: Please provide your details to continue
hi: आगे बढ़ने के लिए जानकारी भरें

source: Full Name
hi: पूरा नाम

# name_validation_message
source: Enter a valid name (no numbers)
hi: सही नाम लिखें (बिना नंबर)

source: Verified
hi: जाँचा हुआ

source: Email (Optional)
hi: ईमेल (चॉइस)

# email_validation_message
source: Enter a valid email address
hi: सही ईमेल लिखें

# profile_save_failed
source: Failed to save profile
hi: प्रोफ़ाइल सेव नहीं हुई

# continue_text
source: Continue
hi: आगे बढ़ें

source: Select Language
hi: भाषा चुनें

source: Home
hi: होम

source: Report
hi: रिपोर्ट

source: Complaints
hi: शिकायतें

source: Profile
hi: प्रोफ़ाइल

source: Good Morning,
hi: सुप्रभात,

source: Good Afternoon,
hi: नमस्कार,

source: Good Evening,
hi: शुभ संध्या,

source: Quick Report
hi: जल्दी रिपोर्ट

source: Garbage
hi: कचरा

source: Street Light
hi: स्ट्रीट लाइट

source: Road Damage
hi: सड़क टूटी

# water
source: Water Supply
hi: पानी सप्लाई

source: Current Badge
hi: मौजूदा बैज

source: Civic Hero
hi: नागरिक हीरो

# badgeProgress
source: 70% to next badge
hi: अगले बैज तक 70%

source: Reports Summary
hi: रिपोर्ट का हाल

source: Total
hi: कुल

source: Pending
hi: बाकी

source: In Progress
hi: प्रगति पर

source: Resolved
hi: समाधान

source: Recent Reports
hi: ताज़ा रिपोर्ट

source: Broken Street Light
hi: टूटी स्ट्रीट लाइट

source: Garbage Collection
hi: कचरा उठाना

source: Pothole Repair
hi: गड्ढा भराई

# reportIssue
source: Report an Issue
hi: समस्या दर्ज करें

source: Select Category
hi: श्रेणी चुनें

# selectCategoryHint
source: Choose a category
hi: एक श्रेणी चुनें

# categoryRequired
source: Category is required
hi: श्रेणी आवश्यक है

source: Subcategory
hi: उप-श्रेणी

# subcategoryHint
source: Choose a subcategory
hi: एक उप-श्रेणी चुनें

# subcategoryRequired
source: Subcategory is required
hi: उप-श्रेणी आवश्यक है

source: Please specify
hi: कृपया लिखें

# pleaseSpecifyIssue
source: Please specify the issue
hi: कृपया समस्या लिखें

source: Capture Photos
hi: फोटो खींचें

# photoNote
source: At least 1 photo required. Up to 3 photos allowed.
hi: कम से कम 1 फोटो ज़रूरी। अधिकतम 3 फोटो।

source: Location
hi: स्थान

source: Auto-detected Location
hi: स्वचालित रूप से मिला स्थान

source: Fetching address...
hi: पता खोजा जा रहा है...

source: Address not found
hi: पता नहीं मिला

source: Fetching GPS...
hi: जीपीएस खोजा जा रहा है...

source: Refresh
hi: रीफ़्रेश

source: Additional Details
hi: अतिरिक्त विवरण

source: Enter details...
hi: विवरण दर्ज करें...

source: Recording...
hi: रिकॉर्ड हो रहा है...

source: Playing...
hi: चल रहा है...

# recordVoiceNote
source: Record voice note (optional)
hi: वॉइस नोट रिकॉर्ड करें (वैकल्पिक)

source: Voice note recorded
hi: वॉइस नोट रिकॉर्ड किया गया

source: Delete voice note
hi: वॉइस नोट हटाएँ

source: Submit Report
hi: रिपोर्ट सबमिट करें

# myReports
source: My Complaints
hi: मेरी रिपोर्टें

source: All
hi: सभी

# footerNote
source: Government of Jharkhand Initiative â€“ Secure & Verified
hi: सरकार की पहल – सुरक्षित और प्रमाणित

source: Settings
hi: सेटिंग्स

source: Notifications
hi: सूचनाएँ

source: Privacy Policy
hi: गोपनीयता नीति

source: Terms of Use
hi: उपयोग की शर्तें

source: Support
hi: सहायता

source: FAQ
hi: सामान्य प्रश्न

source: Contact Support
hi: सपोर्ट से संपर्क करें

source: Logout
hi: लॉग आउट

# workerLoginTitle
source: Worker Login
hi: कर्मचारी लॉगिन

# workerLoginSubtitle
source: Enter your credentials to access the Worker Dashboard
hi: कर्मचारी डैशबोर्ड तक पहुंचने के लिए अपनी जानकारी दर्ज करें

# userIdLabel
source: User ID
hi: यूज़र आईडी

# passwordLabel
source: Password
hi: पासवर्ड

# loginButton
source: Login
hi: लॉगिन करें

# backToCitizenLoginButton
source: Back to Citizen Login
hi: नागरिक लॉगिन पर वापस जाएं

# enterCredentialsError
source: Enter both User ID and Password
hi: यूज़र आईडी और पासवर्ड दोनों दर्ज करें

# invalidCredentialsError
source: Invalid User ID or Password
hi: गलत यूज़र आईडी या पासवर्ड

source: Worker Dashboard
hi: कर्मचारी डैशबोर्ड

source: Municipal Services
hi: नगर सेवाएँ

source: Recent Complaints
hi: हाल की शिकायतें

source: My Tasks
hi: मेरे काम

source: Completed
hi: पूर्ण

# filterAll
source: All
hi: सब

# filterPending
source: Pending
hi: बाकी

# filterInProgress
source: In Progress
hi: कार्य प्रगति पर है

# filterCompleted
source: Completed
hi: पूर्ण

source: Road Maintenance
hi: सड़क मरम्मत

source: Waste Management
hi: कचरा प्रबंधन

source: Street Lighting
hi: बत्ती लगाना

source: Bulb Replacement
hi: बल्ब बदलना

# priorityHigh
source: High
hi: ऊँची

# priorityMedium
source: Medium
hi: मध्यम

# priorityLow
source: Low
hi: कम

# viewDetails
source: Track Complaint
hi: शिकायत को ट्रैक करें

source: Worker ID
hi: वर्कर आईडी

source: Phone Number
hi: फ़ोन नंबर

source: Department
hi: विभाग

source: Assigned Area
hi: नियुक्त क्षेत्र

source: Recognition & Progress
hi: मान्यता और प्रगति

source: Tasks Completed
hi: पूर्ण किए गए कार्य

source: Earned Badges
hi: अर्जित बैज

source: Quick Response
hi: त्वरित प्रतिक्रिया

source: Quality Work
hi: गुणवत्तापूर्ण कार्य

source: On Time
hi: समय पर

source: Change Password
hi: पासवर्ड बदलें

source: Current Password
hi: वर्तमान पासवर्ड

source: New Password
hi: नया पासवर्ड

source: Confirm Password
hi: पासवर्ड की पुष्टि करें

source: Update
hi: अपडेट करें

source: Cancel
hi: रद्द करें

# passwordTooShort
source: Password must be at least 6 characters
hi: पासवर्ड कम से कम 6 अक्षरों का होना चाहिए

source: Passwords do not match
hi: पासवर्ड मेल नहीं खाते

# passwordUpdateSuccess
source: Password updated successfully
hi: पासवर्ड सफलतापूर्वक अपडेट किया गया

# currentPasswordIncorrect
source: Current password is incorrect
hi: वर्तमान पासवर्ड गलत है

source: Change Language
hi: भाषा बदलें

source: Pause Voice Note
hi: वॉइस नोट रोकें

source: Play Voice Note
hi: वॉइस नोट चलाएं

source: Complaint not found.
hi: शिकायत नहीं मिली।

source: REF: {id}
hi: संदर्भ: {id}

source: Close
hi: बंद करें

source: Status Timeline
hi: स्टेटस टाइमलाइन

# submitted
source: Complaint Submitted
hi: जमा किया गया

# reportSubmittedByCitizen
source: Your complaint has been submitted successfully!
hi: नागरिक द्वारा रिपोर्ट जमा की गई।

source: Assigned
hi: सौंपा गया

source: Timestamp not available
hi: समय उपलब्ध नहीं है

# assignedToMunicipalWorker
source: Your complaint has been assigned to a municipal worker
hi: आपकी शिकायत की हमारी टीम द्वारा 24 घंटों के भीतर समीक्षा की जाएगी ।

# assignedToMunicipalworker
source: Your complaint will be reviewed by our team within 24 hours and assigned to the relevant department for resolution.
hi: आपकी शिकायत की हमारी टीम द्वारा 24 घंटों के भीतर समीक्षा की जाएगी और समाधान के लिए संबंधित विभाग को सौंपी जाएगी।

source: Update timestamp pending
hi: अपडेट का समय लंबित है

# workHasStarted
source: Work has started on your complaint.
hi: आपकी शिकायत पर काम शुरू हो गया है।

# issueResolved
source: The issue has been resolved.
hi: समस्या का समाधान हो गया है।

source: Report Details
hi: रिपोर्ट विवरण

source: Photos Submitted
hi: तस्वीरें जमा की गईं

source: Issue Description
hi: समस्या का विवरण

# errorMessage
source: Error
hi: त्रुटि

source: Not available
hi: उपलब्ध नहीं

source: Worker
hi: कर्मचारी

source: Pending Review
hi: समीक्षा के लिए लंबित

source: Current Stage
hi: वर्तमान चरण

# waitingForAssignment
source: Waiting for worker assignment
hi: कर्मचारी नियुक्ति की प्रतीक्षा में

source: Not Yet
hi: अभी नहीं

# raiseGrievance
source: Raise a Grievance
hi: शिकायत दर्ज करें

source: Select Language
hi: भाषा चुनें

source: Success!
hi: सफलता!

# reportIssuee
source: Report Another Issue
hi: एक और समस्या दर्ज करें

source: Complaint Details
hi: शिकायत का विवरण

source: Complaint ID
hi: शिकायत आईडी

source: Navigate
hi: नेविगेट करें

source: Citizen Submission
hi: नागरिक द्वारा प्रस्तुत

source: Photos
hi: तस्वीरें

source: No photos available.
hi: कोई तस्वीर उपलब्ध नहीं है।

source: Description
hi: विवरण

source: Completion Proof
hi: कार्य समाप्ति का प्रमाण

# noCompletionPhotos
source: No completion photos available.
hi: कार्य समाप्ति की कोई तस्वीर उपलब्ध नहीं है।

source: No description provided.
hi: कोई विवरण नहीं दिया गया।

source: Upload Completion Photos
hi: कार्य समाप्ति की तस्वीरें अपलोड करें

source: Mark as In Progress
hi: कार्य प्रगति पर है के रूप में चिह्नित करें

# statusUpdated
source: Status updated to "{status}"
hi: स्थिति "{status}" में अपडेट की गई

# failedToUpdateStatus
source: Failed to update status: {error}
hi: स्थिति अपडेट करने में विफल: {error}

source: Could not open Maps
hi: नक्शा नहीं खोल सका

# completionProofTitle
source: Completion Proof
hi: कार्य समाप्ति का प्रमाण

# completionProofInfo
source: Upload at least 1 photo (max 3) as proof of work completion.
hi: कार्य समाप्ति के प्रमाण के रूप में कम से कम 1 फोटो (अधिकतम 3) अपलोड करें।

# photoRequirementNote
source: At least 1 photo required. Up to 3 photos allowed.
hi: कम से कम 1 फोटो आवश्यक है। अधिकतम 3 फोटो की अनुमति है।

# addNotesHint
source: Add notes/remarks (optional)
hi: नोट्स/टिप्पणी जोड़ें (वैकल्पिक)

source: Submitting...
hi: सबमिट हो रहा है...

source: Submit
hi: सबमिट करें

# failedToSubmitProof
source: Failed to submit proof: {error}
hi: प्रमाण सबमिट करने में विफल: {error}

source: Storage permission denied
hi: स्टोरेज की अनुमति नहीं है

source: Work Completion Report
hi: कार्य समाप्ति रिपोर्ट

# pdfComplaintId
source: Complaint ID: {id}
hi: शिकायत आईडी: {id}

# pdfSupervisorId
source: Supervisor ID: {id}
hi: सुपरवाइजर आईडी: {id}

# pdfCitizenId
source: Citizen ID: {id}
hi: नागरिक आईडी: {id}

# pdfStatus
source: Status: Completed
hi: स्थिति: पूर्ण

# pdfDate
source: Date: {date}
hi: दिनांक: {date}

# downloadsDirNotFound
source: Downloads directory not found
hi: डाउनलोड डायरेक्टरी नहीं मिली

# downloaded
source: Downloaded successfully
hi: सफलतापूर्वक डाउनलोड किया गया

# failedToDownloadReport
source: Failed to download report: {error}
hi: रिपोर्ट डाउनलोड करने में विफल: {error}

source: Work Marked as Resolved!
hi: कार्य समाधान के रूप में चिह्नित!

# completionProofSent
source: Your completion proof has been sent to the complaint owner and supervisor.
hi: आपका कार्य समाप्ति का प्रमाण शिकायतकर्ता और सुपरवाइजर को भेज दिया गया है।

source: Share Status
hi: स्थिति साझा करें

source: Download Report
hi: रिपोर्ट डाउनलोड करें

source: Back to Home
hi: होम पर वापस जाएं

# workerNotificationsTitle
source: Notifications
hi: सूचनाएं

source: No notifications yet.
hi: अभी तक कोई सूचना नहीं है।

# faqTitle
source: FAQ
hi: अक्सर पूछे जाने वाले प्रश्न

# faqQ1
source: How do I submit a complaint?
hi: मैं शिकायत कैसे दर्ज करूं?

# faqA1
source: Go to the home page and tap the '+' button or 'Report Issue' to submit a new complaint.
hi: होम पेज पर जाएं और '+' बटन या 'समस्या रिपोर्ट करें' पर टैप करके नई शिकायत दर्ज करें।

# faqQ2
source: How can I track my complaint status?
hi: मैं अपनी शिकायत की स्थिति कैसे ट्रैक कर सकता हूं?

# faqA2
source: Open 'My Reports' to see the status and details of all your complaints.
hi: अपनी सभी शिकायतों की स्थिति और विवरण देखने के लिए 'मेरी रिपोर्ट' खोलें।

# faqQ3
source: How do I update my profile information?
hi: मैं अपनी प्रोफ़ाइल जानकारी कैसे अपडेट करूं?

# faqA3
source: Tap the edit icon on your profile page to update your name or email.
hi: अपना नाम या ईमेल अपडेट करने के लिए अपनी प्रोफ़ाइल पेज पर एडिट आइकन पर टैप करें।

# faqQ4
source: What do the different complaint statuses mean?
hi: विभिन्न शिकायत स्थितियों का क्या मतलब है?

# faqA4
source: Pending: Waiting for review. Assigned: Assigned to a worker. In Progress: Work has started. Resolved: Issue has been fixed.
hi: बाकी: समीक्षा की प्रतीक्षा में। सौंपा गया: एक कार्यकर्ता को सौंपा गया। प्रगति पर: काम शुरू हो गया है। समाधान: समस्या ठीक हो गई है।

# faqQ5
source: How do I raise a grievance if my complaint is not resolved?
hi: यदि मेरी शिकायत का समाधान नहीं होता है तो मैं शिकायत कैसे दर्ज करूं?

# faqA5
source: Open the complaint details and tap 'Raise Grievance' at the bottom.
hi: शिकायत विवरण खोलें और नीचे 'शिकायत दर्ज करें' पर टैप करें।
